# -*- coding: utf-8 -*-
from Course import Course


class CoursesTest:

    def __init__(self):
        self.__lst = [
            Course("104031", "חשבון אינפיניטסימלי 1מ'", 5.5),
            Course("104166", "אלגברה אמ'", 5.5),
            Course("234114", "מבוא למדעי המחשב מ'", 4),
            Course("234129", "מב.לתורת הקבוצות ואוטומטים למדמח", 3),
            Course("324033", "אנגלית טכנית-מתקדמים ב'", 3),
            Course("104032", "חשבון אינפיניטסימלי 2מ'", 5, [["104031"]]),
            Course("114071", "פיסיקה 1מ", 3.5),
            Course("234124", "מבוא לתכנות מערכות", 4, [["234114"]]),
            Course("234125", "אלגוריתמים נומריים'", 3, [["234114"]]),
            Course("234141", "קומבינטוריקה למדעי המחשב", 3, [["104031", "104166"]]),
            Course("094412", "הסתברות מ", 4, [["104031"]]),
            Course("104134", "אלגברה מודרנית ח'", 2.5, [["104166"]]),
            Course("234218", "מבני נתונים 1", 3, [["094412", "234124", "234141"]], ["094412"]),
            Course("044252", "מערכות ספרתיות ומבנה המחשב", 5, [["234114"]]),
            Course("234292", "לוגיקה למדעי המחשב", 3, [["234129"]]),
            Course("234118", "ארגון ותכנות המחשב", 3, [["234124", "044252"]]),
            Course("234123", "מערכות הפעלה", 4.5, [["234218"]], ),
            Course("234247", "אלגוריתמים 1", 3, [["234141", "234218"]]),
            Course("236360", "תורת הקומפילציה", 3, [["234118", "234129"]]),
            Course("236343", "תורת החישוביות", 3, [["234247"]]),
            Course("236501", "מבוא לבינה מלאכותית", 3, [["234247"]]),
            Course("236756", "מבוא למערכות לומדות", 3, [["094412", "234125"]]),
            Course("236363", "מסדי נתונים", 3, [["234292"]]),
            Course("236299", "מבוא לעיבוד שפות טבעיות", 3, [["234247"]]),
            Course("236350", "הגנה ברשתות", 3, [["234123"]]),
            Course("104033", "אנליזה וקטורית", 2.5),
            Course("125001", "כימיה כללית", 3, [["234247"]]),
            Course("134058", "ביולוגיה 1", 3),
            Course("134020", "גנטיקה כללית", 3.5, [["134058"]]),
            Course("094591", "מבוא לכלכלה", 3.5, [["104031"]]),
            Course("236663", "נושאים מתקדמים בתורת המשחקים", 3, [["234247"]]),
            Course("236502", "פרויקט בבינה מלאכותית", 3, [["236501"]]),
            Course("236754", "פרויקט במערכות נבונות", 3, [["236501"]]),
            Course("234901", "סדנה בתכנות תחרותי", 3, [["234247"]]),
            Course("000011", "ספורט 1", 1),
            Course("000012", "ספורט 2", 1, [['11']]),
            Course("000021", "העשרה 1", 2),
            Course("000022", "העשרה 2", 2),
            Course("000023", "העשרה 3", 2, [['21']]),
            Course("000031", "חופשית 1", 2)

        ]

    def get_lst(self):
        return self.__lst
